code-review/NRB_3471_3546/База_Было/InformationRegisters/ЭтапыКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭтапыКД</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСообщенияИсходный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУведомления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтапКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыКД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БПОбработкиWTRCСообщения</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ОбработкаWTRCСообщения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозможноФормированиеУведомленияКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КД</Name>
					<Comment>(Карточка КД)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеКлиентам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументКД</Name>
					<Comment>(связанный документ по карточке КД)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЭтапыКД/Ext/ManagerModule.bsl
// Возвращает реквизиты последней входящей записи на дату среза по указаному КД
Функция ПоследниеВходящиеПараметрыКД(КД, ДатаСреза = Неопределено) Экспорт
	Срез = Новый Структура("Этап, ТипУведомления",
		Справочники.ЭтапыКД.ПустаяСсылка(), Справочники.ТипыУведомления.ПустаяСсылка());
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапыКД.ЭтапКД КАК Этап,
	|	ЭтапыКД.ТипУведомления КАК ТипУведомления
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|ГДЕ
	|	ЭтапыКД.Период <= &ДатаСреза
	|	И ЭтапыКД.КД = &КД
	|	И НЕ ЭтапыКД.Исходящее
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыКД.Период УБЫВ");
	Запрос.УстановитьПараметр("ДатаСреза", ?(ЗначениеЗаполнено(ДатаСреза), ДатаСреза, ТекущаяДата()));
	Запрос.УстановитьПараметр("КД", КД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Срез, Выборка);
	КонецЕсли;
	
	Возврат Срез;
КонецФункции
